README.org
#+PROPERTY: header-args :exports both
#+PROPERTY: header-args:sage  :session mussys :results output
#+PROPERTY: header-args :cache no
#+OPTIONS: num:nil


* Musical Systems

** Introduction

We provide here the routines to work with new musical systems as described in the paper [[https://web.math.utk.edu/~finotti/papers/mussys.pdf][Alternative Symmetries and Systems]].  But even if one is only interested in working with the standard system, the routines provide some tools for dealing with common music theory elements.

Note that these routines run in [[https://www.sagemath.org/][Sage]], not straight [[https://www.python.org/][Python]], as it makes it easier to deal with permutation and groups.

Sage is free and open source, and can be used in any platform.  If one wants to use it without having to install it, [[https://cocalc.com/][Cocalc]] allows you to run it online, but it is necessary to create an account.

The file ~MusicalSystem.sage~ provides all necessary routines.  It provides five classes:

- ~MusicalSystem~: allows you to create new musical systems and manipulate some of its elements.
- ~SetClass~: to deal with set classes in new musical systems.
- ~ForteTable:~ to produce Forte tables for new musical systems.
- ~ClassElements:~ to see the set of all set classes and their elements of a fixed size in a musical system.
- ~Webern Matrix:~ to produce examples of Webern matrices in new systems.

We describe the functionality of each below.


