README.md
- [Musical Systems](#org06a1cec)
  - [Introduction](#org1c1fa9d)
  - [Musical Systems](#org4722bc4)
  - [Set Classes](#org939a8e3)
  - [Forte Table](#org7e4cdbb)
  - [Class Elements](#orgc78dc30)
  - [Webern Matrices](#org58b0278)



<a id="org06a1cec"></a>

# Musical Systems


<a id="org1c1fa9d"></a>

## Introduction

We provide here the routines to work with new musical systems as described in the paper [Alternative Symmetries and Systems](). But even if one is only interested in working with the standard system, the routines provide some tools for dealing with common music theory elements.

Note that these routines run in [Sage](https://www.sagemath.org/), not straight [Python](https://www.python.org/), as it makes it easier to deal with permutation and groups.

Sage is free and open source, and can be used in any platform. If one wants to use it without having to install it, [Cocalc](https://cocalc.com/) allows you to run it online, but it is necessary to create an account.

The file `MusicalSystem.sage` provides all necessary routines. It provides five classes:

-   `MusicalSystem`: allows you to create new musical systems and manipulate some of its elements.
-   `SetClass`: to deal with set classes in new musical systems.
-   `ForteTable:` to produce Forte tables for new musical systems.
-   `ClassElements:` to see the set of all set classes and their elements of a fixed size in a musical system.
-   `Webern Matrix:` to produce examples of Webern matrices in new systems.

We describe the functionality of each below.
