README.md


<a id="org4722bc4"></a>

## Musical Systems

We will walk through some of the features with some concrete examples. First we need to load the file:

```sage
load('MusicalSystem.sage')
```

One can create the standard (equal temperament) system by calling `MusicalSystem` with no arguments:

```sage
SMS = MusicalSystem()
SMS
```

    MusicalSystem(rho=(0,1,2,3,4,5,6,7,8,9,10,11), phi=(1,11)(2,10)(3,9)(4,8)(5,7)): Musical System given by rotation (0,1,2,3,4,5,6,7,8,9,10,11) and reflection (1,11)(2,10)(3,9)(4,8)(5,7)

To create a new system, let's first create the symmetric group on integers modulo 12 (or the set {0, 1, 2, 3, &#x2026; , 11}) in Sage:

```sage
S12 = SymmetricGroup(range(12))
```

**IMPORTANT:** Note that Sage, like commonly in group theory, compose permutations from left to right, instead of the usual right to left used for functions in general in all mathematics. So, for Sage, `(sigma * tau)(x)` means `tau(sigma(x))`, and not the usual `sigma(tau(x))`. On the other hand, */I will always refer to composition the usual way*, i.e., from right to left.

Let's also create the standard rotation/transposition and reflection/inversion:

```sage
rho = S12([(0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11)])
phi = S12([(1, 11), (2, 10), (3, 9), (4, 8), (5, 7)])
```

We can obtain the corresponding rotation and reflection from a system with `.rho` and `.phi`:

```sage
SMS.rho == rho, SMS.phi == phi
```

    (True, True)

Let's now create a new system given by the rotation `(0, 4, 11, 3, 7, 2, 6, 10, 5, 9, 1, 8)` and the usual reflection `phi`:

```sage
rho1 = S12([(0, 4, 11, 3, 7, 2, 6, 10, 5, 9, 1, 8)])
phi1 = phi  # same as the standard system
MS1 = MusicalSystem(rho1, phi1)
MS1
```

    MusicalSystem(rho=(0,4,11,3,7,2,6,10,5,9,1,8), phi=(1,11)(2,10)(3,9)(4,8)(5,7)): Musical System given by rotation (0,4,11,3,7,2,6,10,5,9,1,8) and reflection (1,11)(2,10)(3,9)(4,8)(5,7)

As observed in the paper, every new system can be given by a conjugation of the original dihedral group by some permutation. We can use a permutation to create a new system with `MusicalSystem.from_conj`:

```sage
sigma = S12([(0,1,8,7,6,9), (2,5,3,11,4)])  # some permutation
MS2 = MusicalSystem.from_conj(sigma)
MS2
```

    MusicalSystem(rho=(0,10,4,1,8,5,11,2,3,9,6,7), phi=(1,9)(2,5)(3,8)(4,6)(7,10)): Musical System given by rotation (0,10,4,1,8,5,11,2,3,9,6,7) and reflection (1,9)(2,5)(3,8)(4,6)(7,10)

Let's save the corresponding rotation and reflection as `rho2` and `phi2`:

```sage
rho2, phi2 = MS2.rho, MS2.phi
```

Note that we can get also the *group* of symmetries itself from the system with `.group`:

```sage
H2 = MS2.group
H2
```

    Subgroup generated by [(1,9)(2,5)(3,8)(4,6)(7,10), (0,10,4,1,8,5,11,2,3,9,6,7)] of (Symmetric group of order 12! as a permutation group)

Of course, it is a dihedral group:

```sage
H2.is_isomorphic(DihedralGroup(12))
```

    True

We can measure intervals in any of the systems. Let's see what are the intervals between the pitch classes 3 and 10 in these systems:

```sage
SMS.interval(3, 10), MS1.interval(3, 10), MS2.interval(3, 10)
```

    (7, 4, 5)

Let's check:

```sage
(rho^7)(3) == 10, (rho1^4)(3) == 10, (rho2^5)(3) == 10
```

    (True, True, True)

We can also ask for the interval class:

```sage
SMS.interval_class(3, 10), MS1.interval_class(3, 10), MS2.interval_class(3, 10)
```

    (5, 4, 5)

Of course, we can change the order and obtain the same result:

```sage
SMS.interval_class(10, 3), MS1.interval_class(10, 3), MS2.interval_class(10, 3)
```

    (5, 4, 5)

Given a pitch class set (given as a list), we can ask for the normal form in the corresponding system:

```sage
pc_set = [3, 5, 10, 11]
SMS.normal_form(pc_set), MS1.normal_form(pc_set), MS2.normal_form(pc_set)
```

    ([10, 11, 3, 5], [11, 3, 10, 5], [10, 5, 11, 3])

We can also find what are the symmetries of a pitch class set for each system:

```sage
pc_set = [0, 4, 8]
SMS.symmetries(pc_set)
```

    [(0, 0), (4, 0), (8, 0), (0, 1), (4, 1), (8, 1)]

The output tells us that the pitch class set `[0, 4, 8]` is mapped onto itself by `rho^0 * phi^0` (the identity), `rho^4 * phi^0 = \rho^4`, `rho^8 phi^0 = rho^8`, `rho^0 * phi^1 = \phi`, `rho^4 * phi^1 = rho^4 * phi`, and `rho^8 * phi^1 = rho^8 * phi`. (Note, here I'm writing in the *usual* way, but in computations in Sage `rho` and `phi` have to be switched.)

Let's check if this same set has any symmetries in the other systems:

```sage
MS1.symmetries(pc_set)
```

    [(0, 0), (0, 1)]

So, in the systems `MS1`, only the identity and `phi1` preserve the set.

```sage
MS2.symmetries(pc_set)
```

    [(0, 0), (4, 1)]

In the system `MS2`, only the identity and `rho_2^4 * phi_2` preserve the set.

We can also compute class sums of pitch class sets in any system:

```sage
pc_set = [0, 3, 8, 10]
SMS.class_sum(pc_set), MS1.class_sum(pc_set), MS2.class_sum(pc_set)
```

    (9, 9, 1)

We also have functions to compute symmetries of pitch class sets. To apply the rotation of the system to all pitch classes in the set:

```sage
pc_set = [0, 1, 6]
SMS.vrho(pc_set), MS1.vrho(pc_set), MS2.vrho(pc_set)
```

    ([1, 2, 7], [10, 8, 4], [7, 10, 8])

By default, the result is in *normal form*. Given the option `sort='none'`, it give the result with the outputs ordered according to input:

```sage
pc_set = [0, 1, 6]
SMS.vrho(pc_set, sort='none'), MS1.vrho(pc_set, sort='none'), MS2.vrho(pc_set, sort='none')
```

    ([1, 2, 7], [4, 8, 10], [10, 8, 7])

We can also ask to order in increasing numerical order with the option `sort='sort'`:

```sage
pc_set = [0, 1, 6]
SMS.vrho(pc_set, sort='sort'), MS1.vrho(pc_set, sort='sort'), MS2.vrho(pc_set, sort='sort')
```

    ([1, 2, 7], [4, 8, 10], [7, 8, 10])

Finally, we can sort according to the interval to the pitch class 0 in the system with `sort='rho'`:

```sage
pc_set = [0, 1, 6]
SMS.vrho(pc_set, sort='rho'), MS1.vrho(pc_set, sort='rho'), MS2.vrho(pc_set, sort='rho')
```

    ([1, 2, 7], [4, 10, 8], [10, 8, 7])

We can also compute powers of the rotation with optional argument `power`, for instance, let's take the 4th power:

```sage
pc_set = [0, 1, 6]
SMS.vrho(pc_set, power=4), MS1.vrho(pc_set, power=4), MS2.vrho(pc_set, power=4)
```

    ([4, 5, 10], [1, 11, 7], [4, 8, 2])

We also have the corresponding method `.vphi` for the reflection:

```sage
pc_set = [1, 2, 6]
SMS.vphi(pc_set, sort='none'), MS1.vphi(pc_set, sort='none'), MS2.vphi(pc_set, sort='none')
```

    ([11, 10, 6], [11, 10, 6], [9, 5, 4])

(Remember that `phi_1 = phi`.)

To mix those, we can call `.vmap`. The first argument is the power of the rotation and the second is the power of the reflection, while the third is the pitch class set. Note that the power of the reflection is computed **first** and the power of the rotation **second**. It has the same sorting options as `.vhro` and `.vphi`:

```sage
pc_set = [1, 2, 6]
SMS.vmap(4, 1, pc_set, sort='none'), MS1.vmap(4, 1, pc_set, sort='none'), MS2.vmap(4  , 1, pc_set, sort='none')
```

    ([3, 2, 10], [6, 8, 1], [10, 9, 11])

Finally, given two pitch class sets, we can ask what symmetries of the system maps one to the other:

```sage
pc1 = [0, 3, 5]
pc2 = [2, 4, 7]
MS2.symmetry_maps(pc1, pc2)
```

    [(7, 1)]

This means that `rho2^7 * phi2` (composing the permutations the *usual way* again, from right to left) maps `[0, 3, 5]` to `[2, 4, 7]` in the system `MS2`:

```sage
MS2.vmap(7, 1, pc1)
```

    [2, 7, 4]

(Note that order of the elements in the set does not matter.)
