README.org
** Set Classes

We can also create set classes in different systems.  Still with the systems ~SMS~, ~MS1~, and ~MS2~ above, we can create set classes with:

#+begin_src sage
  pc_set = [0, 4, 8]
  sc, sc1, sc2 = SetClass(pc_set, MS=SMS), SetClass(pc_set, MS=MS1),  SetClass(pc_set, MS=MS2)
  sc, sc1, sc2
#+end_src

#+RESULTS[deb4ddd42c3f3c5225e9d14dda59dad3035e970a]:
: (SetClass([0, 4, 8]), with rho = (0,1,2,3,4,5,6,7,8,9,10,11), phi = (1,11)(2,10)(3,9)(4,8)(5,7).  Prime form: (048),
:  SetClass([0, 4, 8]), with rho = (0,4,11,3,7,2,6,10,5,9,1,8), phi = (1,11)(2,10)(3,9)(4,8)(5,7).  Prime form: (04e),
:  SetClass([0, 4, 8]), with rho = (0,10,4,1,8,5,11,2,3,9,6,7), phi = (1,9)(2,5)(3,8)(4,6)(7,10).  Prime form: (048))


We can also create set classes directly from the system:

#+begin_src sage
  MS1.set_class([2, 5, 11])
#+end_src

#+RESULTS:
: SetClass([2, 5, 11]), with rho = (0,4,11,3,7,2,6,10,5,9,1,8), phi = (1,11)(2,10)(3,9)(4,8)(5,7).  Prime form: (036)

We can ask for the number of internal symmetries:

#+begin_src sage
  sc.nsym(), sc1.nsym(), sc2.nsym()
#+end_src

#+RESULTS[ff7e0b0327e892e5af0f0afdf292b267937e300e]:
: ([3, 3], [1, 1], [1, 1])

The first element is the number of tranpositional symmetries (including the identity) and the second is the number of reflexive symmetries.  We can actually see what the symmetries are with ~.symmetries~:

#+begin_src sage
sc.symmetries(), sc1.symmetries(), sc2.symmetries()
#+end_src

#+RESULTS[6f9b6e5119b41250053d79c0808245286b6a2873]:
: ([(0, 0), (4, 0), (8, 0), (0, 1), (4, 1), (8, 1)],
:  [(0, 0), (2, 1)],
:  [(0, 0), (4, 1)])

We can also ask for the complement of a set class:

#+begin_src sage
  sc2, sc2.complement()
#+end_src

#+RESULTS:
: (SetClass([0, 4, 8]), with rho = (0,10,4,1,8,5,11,2,3,9,6,7), phi = (1,9)(2,5)(3,8)(4,6)(7,10).  Prime form: (048),
:  SetClass([1, 2, 3, 5, 6, 7, 9, 10, 11]), with rho = (0,10,4,1,8,5,11,2,3,9,6,7), phi = (1,9)(2,5)(3,8)(4,6)(7,10).  Prime form: (0t4185e36))

And we can ask for class sums:

#+begin_src sage
  sc1.class_sum()
#+end_src

#+RESULTS:
: 3

We can ask for all pitch class sets in a set class.  For instance:

#+begin_src sage
  sc1.elements()
#+end_src

#+RESULTS:
#+begin_example
[(0, 4, 11),
 (1, 8, 0),
 (2, 6, 10),
 (3, 7, 2),
 (4, 11, 3),
 (5, 9, 1),
 (6, 10, 5),
 (7, 2, 6),
 (8, 0, 4),
 (9, 1, 8),
 (10, 5, 9),
 (11, 3, 7)]
#+end_example

Note that the results are in normal form.

As another example, if I want to know all tetrachors that can be mapped to ~[10, 4, 5]~ in ~MS2~, we can do

#+begin_src sage
  SetClass([10, 4, 5], MS=MS2).elements()
#+end_src

#+RESULTS:
#+begin_example
[(0, 1, 8),
 (0, 10, 8),
 (1, 8, 2),
 (1, 11, 2),
 (2, 3, 7),
 (2, 6, 7),
 (3, 7, 0),
 (3, 9, 0),
 (4, 1, 11),
 (4, 5, 11),
 (5, 3, 9),
 (5, 11, 9),
 (6, 7, 4),
 (6, 10, 4),
 (7, 0, 1),
 (7, 4, 1),
 (8, 2, 3),
 (8, 5, 3),
 (9, 0, 10),
 (9, 6, 10),
 (10, 4, 5),
 (10, 8, 5),
 (11, 2, 6),
 (11, 9, 6)]
#+end_example

One can also access various internal properties from the set class.  For instance, the given pitch class set can be recovered with ~.initv~:

#+begin_src sage
  sc1.initv
#+end_src

#+RESULTS:
: [0, 4, 8]

It's normal form can be obtained with ~.normal_form~:

#+begin_src sage
  sc1.normal_form
#+end_src

#+RESULTS:
: [8, 0, 4]

We can recover the corresponding rotation and reflection:

#+begin_src sage
sc1.rho, sc1.phi
#+end_src

#+RESULTS:
: ((0,4,11,3,7,2,6,10,5,9,1,8), (1,11)(2,10)(3,9)(4,8)(5,7))

You can get the musical system as well:

#+begin_src sage
  sc1.MusicalSystem
#+end_src

#+RESULTS:
: MusicalSystem(rho=(0,4,11,3,7,2,6,10,5,9,1,8), phi=(1,11)(2,10)(3,9)(4,8)(5,7)): Musical System given by rotation (0,4,11,3,7,2,6,10,5,9,1,8) and reflection (1,11)(2,10)(3,9)(4,8)(5,7)



