README.md


<a id="org7e4cdbb"></a>

## Forte Table

We can also ask for the *Forte Table* for a system. For instance, here is the Forte Table for trichords and nonachors in the standard system:

```sage
ft = ForteTable(3)
print(ft)
```

    (012)  [ 2 , 1 , 0 , 0 , 0 , 0]   1,  1  [ 8 , 7 , 6 , 6 , 6 , 3]  (012345678)
    (013)  [ 1 , 1 , 1 , 0 , 0 , 0]   1,  0  [ 7 , 7 , 7 , 6 , 6 , 3]  (012345679)
    (014)  [ 1 , 0 , 1 , 1 , 0 , 0]   1,  0  [ 7 , 6 , 7 , 7 , 6 , 3]  (012345689)
    (015)  [ 1 , 0 , 0 , 1 , 1 , 0]   1,  0  [ 7 , 6 , 6 , 7 , 7 , 3]  (012345789)
    (016)  [ 1 , 0 , 0 , 0 , 1 , 1]   1,  0  [ 7 , 6 , 6 , 6 , 7 , 4]  (012346789)
    (024)  [ 0 , 2 , 0 , 1 , 0 , 0]   1,  1  [ 6 , 8 , 6 , 7 , 6 , 3]  (01234568t)
    (025)  [ 0 , 1 , 1 , 0 , 1 , 0]   1,  0  [ 6 , 7 , 7 , 6 , 7 , 3]  (01234578t)
    (026)  [ 0 , 1 , 0 , 1 , 0 , 1]   1,  0  [ 6 , 7 , 6 , 7 , 6 , 4]  (01234678t)
    (027)  [ 0 , 1 , 0 , 0 , 2 , 0]   1,  1  [ 6 , 7 , 6 , 6 , 8 , 3]  (01235678t)
    (036)  [ 0 , 0 , 2 , 0 , 0 , 1]   1,  1  [ 6 , 6 , 8 , 6 , 6 , 4]  (01234679t)
    (037)  [ 0 , 0 , 1 , 1 , 1 , 0]   1,  0  [ 6 , 6 , 7 , 7 , 7 , 3]  (01235679t)
    (048)  [ 0 , 0 , 0 , 3 , 0 , 0]   3,  3  [ 6 , 6 , 6 , 9 , 6 , 3]  (01245689t)

The first and last column have the set classes, the second and second to last have interval vectors, and the two middle columns have the number of transpositional and inversive symmetries, respectively. Note that we do not give the traditional names associated to the rows.

Note that we can also create Forte Tables directly from a system. For instance, the table above could have been created with `SMS.forte_table(3)`.

Let's see it for a different system, say `MS2`, now with tetrachords and octachords:

```sage
ft2 = MS2.forte_table(4)
print(ft2)
```

    (0153)  [ 0 , 1 , 2 , 1 , 2 , 0]   1,  1  [ 4 , 5 , 6 , 5 , 6 , 2]  (0t185236)
    (0182)  [ 1 , 0 , 2 , 2 , 1 , 0]   1,  1  [ 5 , 4 , 6 , 6 , 5 , 2]  (0t185e39)
    (01e9)  [ 0 , 0 , 4 , 0 , 0 , 2]   4,  4  [ 4 , 4 , 8 , 4 , 4 , 4]  (0t18e296)
    (0412)  [ 1 , 1 , 1 , 1 , 2 , 0]   1,  0  [ 5 , 5 , 5 , 5 , 6 , 2]  (0t485e29)
    (0415)  [ 1 , 2 , 2 , 0 , 1 , 0]   1,  1  [ 5 , 6 , 6 , 4 , 5 , 2]  (04185e29)
    (041e)  [ 1 , 1 , 2 , 1 , 0 , 1]   1,  0  [ 5 , 5 , 6 , 5 , 4 , 3]  (0t185e29)
    (0452)  [ 0 , 2 , 1 , 0 , 3 , 0]   1,  1  [ 4 , 6 , 5 , 4 , 7 , 2]  (0t415236)
    (0453)  [ 0 , 1 , 2 , 1 , 1 , 1]   1,  0  [ 4 , 5 , 6 , 5 , 5 , 3]  (0t485236)
    (0482)  [ 0 , 2 , 1 , 1 , 2 , 0]   1,  0  [ 4 , 6 , 5 , 5 , 6 , 2]  (0t415e36)
    (0483)  [ 0 , 2 , 0 , 3 , 0 , 1]   1,  1  [ 4 , 6 , 4 , 7 , 4 , 3]  (0t485e36)
    (048e)  [ 0 , 3 , 0 , 2 , 0 , 1]   1,  1  [ 4 , 7 , 4 , 6 , 4 , 3]  (0t418e36)
    (04e3)  [ 0 , 2 , 0 , 2 , 0 , 2]   2,  2  [ 4 , 6 , 4 , 6 , 4 , 4]  (0t48e236)
    (0t12)  [ 1 , 1 , 1 , 1 , 1 , 1]   1,  0  [ 5 , 5 , 5 , 5 , 5 , 3]  (0t415e29)
    (0t15)  [ 1 , 2 , 1 , 1 , 1 , 0]   1,  0  [ 5 , 6 , 5 , 5 , 5 , 2]  (0t418529)
    (0t18)  [ 2 , 1 , 2 , 1 , 0 , 0]   1,  1  [ 6 , 5 , 6 , 5 , 4 , 2]  (0t4185e9)
    (0t1e)  [ 1 , 1 , 2 , 0 , 1 , 1]   1,  0  [ 5 , 5 , 6 , 4 , 5 , 3]  (0t418e29)
    (0t41)  [ 3 , 2 , 1 , 0 , 0 , 0]   1,  1  [ 7 , 6 , 5 , 4 , 4 , 2]  (0t4185e2)
    (0t42)  [ 2 , 1 , 0 , 0 , 2 , 1]   1,  1  [ 6 , 5 , 4 , 4 , 6 , 3]  (0t415e23)
    (0t45)  [ 2 , 1 , 1 , 1 , 1 , 0]   1,  0  [ 6 , 5 , 5 , 5 , 5 , 2]  (0t418523)
    (0t48)  [ 2 , 2 , 1 , 1 , 0 , 0]   1,  0  [ 6 , 6 , 5 , 5 , 4 , 2]  (0t4185e3)
    (0t4e)  [ 2 , 1 , 0 , 1 , 1 , 1]   1,  0  [ 6 , 5 , 4 , 5 , 5 , 3]  (0t418e23)
    (0t52)  [ 1 , 1 , 0 , 1 , 2 , 1]   1,  0  [ 5 , 5 , 4 , 5 , 6 , 3]  (0t415239)
    (0t53)  [ 1 , 0 , 1 , 2 , 2 , 0]   1,  1  [ 5 , 4 , 5 , 6 , 6 , 2]  (0t485239)
    (0t5e)  [ 2 , 0 , 0 , 1 , 2 , 1]   1,  1  [ 6 , 4 , 4 , 5 , 6 , 3]  (0t418239)
    (0t82)  [ 1 , 0 , 2 , 1 , 1 , 1]   1,  0  [ 5 , 4 , 6 , 5 , 5 , 3]  (0t415e39)
    (0t83)  [ 1 , 0 , 1 , 3 , 1 , 0]   1,  0  [ 5 , 4 , 5 , 7 , 5 , 2]  (0t485e39)
    (0t85)  [ 2 , 0 , 1 , 2 , 1 , 0]   1,  1  [ 6 , 4 , 5 , 6 , 5 , 2]  (0t418539)
    (0t8e)  [ 1 , 1 , 1 , 1 , 1 , 1]   1,  0  [ 5 , 5 , 5 , 5 , 5 , 3]  (0t418e39)
    (0te2)  [ 2 , 0 , 0 , 0 , 2 , 2]   2,  2  [ 6 , 4 , 4 , 4 , 6 , 4]  (0t41e239)

We can also ask for the output in LaTeX:

```sage
print(ft2.latex())
```

    \begin{tabular}{llrll}
      \multicolumn{2}{c}{\textbf{Tetrachords}} &  & \multicolumn{2}{c}{\textbf{Octachords}} \\
      \midrule
      $(0153)$ & $012120$ & $1$, $1$ & $456562$ & $(0t185236)$\\
      $(0182)$ & $102210$ & $1$, $1$ & $546652$ & $(0t185e39)$\\
      $(01e9)$ & $004002$ & $4$, $4$ & $448444$ & $(0t18e296)$\\
      $(0412)$ & $111120$ & $1$, $0$ & $555562$ & $(0t485e29)$\\
      $(0415)$ & $122010$ & $1$, $1$ & $566452$ & $(04185e29)$\\
      $(041e)$ & $112101$ & $1$, $0$ & $556543$ & $(0t185e29)$\\
      $(0452)$ & $021030$ & $1$, $1$ & $465472$ & $(0t415236)$\\
      $(0453)$ & $012111$ & $1$, $0$ & $456553$ & $(0t485236)$\\
      $(0482)$ & $021120$ & $1$, $0$ & $465562$ & $(0t415e36)$\\
      $(0483)$ & $020301$ & $1$, $1$ & $464743$ & $(0t485e36)$\\
      $(048e)$ & $030201$ & $1$, $1$ & $474643$ & $(0t418e36)$\\
      $(04e3)$ & $020202$ & $2$, $2$ & $464644$ & $(0t48e236)$\\
      $(0t12)$ & $111111$ & $1$, $0$ & $555553$ & $(0t415e29)$\\
      $(0t15)$ & $121110$ & $1$, $0$ & $565552$ & $(0t418529)$\\
      $(0t18)$ & $212100$ & $1$, $1$ & $656542$ & $(0t4185e9)$\\
      $(0t1e)$ & $112011$ & $1$, $0$ & $556453$ & $(0t418e29)$\\
      $(0t41)$ & $321000$ & $1$, $1$ & $765442$ & $(0t4185e2)$\\
      $(0t42)$ & $210021$ & $1$, $1$ & $654463$ & $(0t415e23)$\\
      $(0t45)$ & $211110$ & $1$, $0$ & $655552$ & $(0t418523)$\\
      $(0t48)$ & $221100$ & $1$, $0$ & $665542$ & $(0t4185e3)$\\
      $(0t4e)$ & $210111$ & $1$, $0$ & $654553$ & $(0t418e23)$\\
      $(0t52)$ & $110121$ & $1$, $0$ & $554563$ & $(0t415239)$\\
      $(0t53)$ & $101220$ & $1$, $1$ & $545662$ & $(0t485239)$\\
      $(0t5e)$ & $200121$ & $1$, $1$ & $644563$ & $(0t418239)$\\
      $(0t82)$ & $102111$ & $1$, $0$ & $546553$ & $(0t415e39)$\\
      $(0t83)$ & $101310$ & $1$, $0$ & $545752$ & $(0t485e39)$\\
      $(0t85)$ & $201210$ & $1$, $1$ & $645652$ & $(0t418539)$\\
      $(0t8e)$ & $111111$ & $1$, $0$ & $555553$ & $(0t418e39)$\\
      $(0te2)$ & $200022$ & $2$, $2$ & $644464$ & $(0t41e239)$
    \end{tabular}
