README.md


<a id="orgc78dc30"></a>

## Class Elements

We can also print all set classes while listing every element in each set class. (Long output!)

For instance, let's look at out set classes of size four and their elements in the standard system:

```sage
ce = ClassElements(4)
print(ce)
```

The output is too long to be displayed here, but it gives a series of columns, with the prime form of the set class on top, and the elements in the class below it.

We can also break the result in smaller number of columns:

```sage
ce.print_col(ncol=6)
```

Again, the output is too long, but is it more suitable for printing. In the case above, it prints by breaking the output in sets of six columns.

We can produce a class in other system by specifying the system with the optional argument `MS`, as in, for instance, `ClassElements(3, MS=MS1)`. But, this can also be created from the system itself using `.class_ements`:

```sage
ce1 = MS1.class_elements(3)
```

You can access the internal data with `.matrix`. For instance, the following takes the 4th column of the `ce1`, which contains the elements in some set class, with the prime form on top:

```sage
(ce1.matrix)[3]
```

    [(0, 11, 7),
     (1, 0, 11),
     (2, 10, 9),
     (3, 2, 10),
     (4, 3, 2),
     (5, 1, 0),
     (6, 5, 1),
     (7, 6, 5),
     (8, 4, 3),
     (9, 8, 4),
     (10, 9, 8),
     (11, 7, 6)]

As usual, the results are in normal form. Also, we can see now many different set classes of size 3 we have in the system `MS1`:

```sage
len(ce1.matrix)
```

    12

There are 12 different set classes.

We can also see what is the variation of number of elements in the set classes:

```sage
min(len(sc) for sc in ce1.matrix), max(len(sc) for sc in ce1.matrix)
```

    (4, 24)

The number of elements varies from 4 to 24.
