README.org
** Webern Matrices

We can also construct Webern matrices.  To see the original matrix, we can do:

#+begin_src sage
  wm = WebernMatrix()
  print(wm)
#+end_src

#+RESULTS[470577f14ad5c9e8bf18b0862bdd86845058edc6]:
#+begin_example
    |   0  11   3   4   8   7   9   5   6   1   2  10  |
----|--------------------------------------------------|----
 0  |   0  11   3   4   8   7   9   5   6   1   2  10  |  10
 1  |   1   0   4   5   9   8  10   6   7   2   3  11  |  11
 9  |   9   8   0   1   5   4   6   2   3  10  11   7  |   7
 8  |   8   7  11   0   4   3   5   1   2   9  10   6  |   6
 4  |   4   3   7   8   0  11   1   9  10   5   6   2  |   2
 5  |   5   4   8   9   1   0   2  10  11   6   7   3  |   3
 3  |   3   2   6   7  11  10   0   8   9   4   5   1  |   1
 7  |   7   6  10  11   3   2   4   0   1   8   9   5  |   5
 6  |   6   5   9  10   2   1   3  11   0   7   8   4  |   4
11  |  11  10   2   3   7   6   8   4   5   0   1   9  |   9
10  |  10   9   1   2   6   5   7   3   4  11   0   8  |   8
 2  |   2   1   5   6  10   9  11   7   8   3   4   0  |   0
----|--------------------------------------------------|----
    |   2   1   5   6  10   9  11   7   8   3   4   0  |
#+end_example

The numbers on the left are the powers of the rotation that take the first row into the corresponding row.  The numbers on top are the powers of the rotation that when composed with the reflection take the first row into the corresponding /column/.  The right numbers and bottom numbers are similar, but with the /retrogrades/.  See the Section 3 of [[https://web.math.utk.edu/~finotti/papers/mussys.pdf][Alternative Symmetries and Systems]] for more details.

We can also get the whole matrix (without the labels) with ~.matrix~:

#+begin_src sage
wm.matrix
#+end_src

#+RESULTS[7b3436732a5d171d637e3face40774e26acbc2b1]:
#+begin_example
[(0, 11, 3, 4, 8, 7, 9, 5, 6, 1, 2, 10),
 [1, 0, 4, 5, 9, 8, 10, 6, 7, 2, 3, 11],
 [9, 8, 0, 1, 5, 4, 6, 2, 3, 10, 11, 7],
 [8, 7, 11, 0, 4, 3, 5, 1, 2, 9, 10, 6],
 [4, 3, 7, 8, 0, 11, 1, 9, 10, 5, 6, 2],
 [5, 4, 8, 9, 1, 0, 2, 10, 11, 6, 7, 3],
 [3, 2, 6, 7, 11, 10, 0, 8, 9, 4, 5, 1],
 [7, 6, 10, 11, 3, 2, 4, 0, 1, 8, 9, 5],
 [6, 5, 9, 10, 2, 1, 3, 11, 0, 7, 8, 4],
 [11, 10, 2, 3, 7, 6, 8, 4, 5, 0, 1, 9],
 [10, 9, 1, 2, 6, 5, 7, 3, 4, 11, 0, 8],
 [2, 1, 5, 6, 10, 9, 11, 7, 8, 3, 4, 0]]
#+end_example

If you want just the labels, we can get them with ~.left~, ~.top~,  ~.right~, ~.bottom~:

#+begin_src sage
wm.left, wm.top, wm.right, wm.bottom
#+end_src

#+RESULTS[ab103fb32ecfd4c4055f62d394dc7ac3196d6bc9]:
: ([0, 1, 9, 8, 4, 5, 3, 7, 6, 11, 10, 2],
:  [0, 11, 3, 4, 8, 7, 9, 5, 6, 1, 2, 10],
:  [10, 11, 7, 6, 2, 3, 1, 5, 4, 9, 8, 0],
:  [2, 1, 5, 6, 10, 9, 11, 7, 8, 3, 4, 0])

Or, we can extract rows and columns (indexing starting at 0, as usual in Python/Sage):

#+begin_src sage
  wm.row(3), wm.column(8)
#+end_src

#+RESULTS[395299513fde265ccb794b719b963490442435e5]:
: ([8, 7, 11, 0, 4, 3, 5, 1, 2, 9, 10, 6],
:  [6, 7, 3, 2, 10, 11, 9, 1, 0, 5, 4, 8])

We can also print it with LaTeX:

#+begin_src sage
print(wm.latex())
#+end_src

#+RESULTS[b53ecba4da6cfa6e2321b6d17636ea6d4ee8e59c]:
#+begin_example
\begin{tabular}{c|cccccccccccc|c}
     &  $\phi$ &  $\rho^{11} \phi$ &  $\rho^{3} \phi$ &  $\rho^{4} \phi$ &  $\rho^{8} \phi$ &  $\rho^{7} \phi$ &  $\rho^{9} \phi$ &  $\rho^{5} \phi$ &  $\rho^{6} \phi$ &  $\rho \phi$ &  $\rho^{2} \phi$ &  $\rho^{10} \phi$ &    \\
  \hline
  $1$ & $0$ & $11$ & $3$ & $4$ & $8$ & $7$ & $9$ & $5$ & $6$ & $1$ & $2$ & $10$ & $\rho^{10}$ \\
  $\rho$ & $1$ & $0$ & $4$ & $5$ & $9$ & $8$ & $10$ & $6$ & $7$ & $2$ & $3$ & $11$ & $\rho^{11}$ \\
  $\rho^{9}$ & $9$ & $8$ & $0$ & $1$ & $5$ & $4$ & $6$ & $2$ & $3$ & $10$ & $11$ & $7$ & $\rho^{7}$ \\
  $\rho^{8}$ & $8$ & $7$ & $11$ & $0$ & $4$ & $3$ & $5$ & $1$ & $2$ & $9$ & $10$ & $6$ & $\rho^{6}$ \\
  $\rho^{4}$ & $4$ & $3$ & $7$ & $8$ & $0$ & $11$ & $1$ & $9$ & $10$ & $5$ & $6$ & $2$ & $\rho^{2}$ \\
  $\rho^{5}$ & $5$ & $4$ & $8$ & $9$ & $1$ & $0$ & $2$ & $10$ & $11$ & $6$ & $7$ & $3$ & $\rho^{3}$ \\
  $\rho^{3}$ & $3$ & $2$ & $6$ & $7$ & $11$ & $10$ & $0$ & $8$ & $9$ & $4$ & $5$ & $1$ & $\rho$ \\
  $\rho^{7}$ & $7$ & $6$ & $10$ & $11$ & $3$ & $2$ & $4$ & $0$ & $1$ & $8$ & $9$ & $5$ & $\rho^{5}$ \\
  $\rho^{6}$ & $6$ & $5$ & $9$ & $10$ & $2$ & $1$ & $3$ & $11$ & $0$ & $7$ & $8$ & $4$ & $\rho^{4}$ \\
  $\rho^{11}$ & $11$ & $10$ & $2$ & $3$ & $7$ & $6$ & $8$ & $4$ & $5$ & $0$ & $1$ & $9$ & $\rho^{9}$ \\
  $\rho^{10}$ & $10$ & $9$ & $1$ & $2$ & $6$ & $5$ & $7$ & $3$ & $4$ & $11$ & $0$ & $8$ & $\rho^{8}$ \\
  $\rho^{2}$ & $2$ & $1$ & $5$ & $6$ & $10$ & $9$ & $11$ & $7$ & $8$ & $3$ & $4$ & $0$ & $1$ \\
  \hline
     &  $\rho^{2} \phi$ &  $\rho \phi$ &  $\rho^{5} \phi$ &  $\rho^{6} \phi$ &  $\rho^{10} \phi$ &  $\rho^{9} \phi$ &  $\rho^{11} \phi$ &  $\rho^{7} \phi$ &  $\rho^{8} \phi$ &  $\rho^{3} \phi$ &  $\rho^{4} \phi$ &  $\phi$ &
\end{tabular}
#+end_example

We can also create new Webern matrices using other systems, but first we need a first row.  Let's use ~MS2~.  We can get possible first rows with:

#+begin_src sage :results none
  first_webern_rows = MS2.find_all_first_webern_rows()
#+end_src

The complete output is too long:

#+begin_src sage
  len(first_webern_rows)
#+end_src

#+RESULTS:
: 204

So, lets look at only the first 20 possible rows:

#+begin_src sage
first_webern_rows[:20]
#+end_src

#+RESULTS:
#+begin_example
[[(0, 1, 3), (2, 7, 8), (4, 5, 6), (9, 10, 11), [3, 3]],
 [(0, 1, 3), (2, 7, 8), (4, 5, 9), (6, 10, 11), [3, 3]],
 [(0, 1, 3), (2, 7, 8), (5, 6, 10), (4, 9, 11), [3, 3]],
 [(0, 1, 3), (5, 6, 10), (4, 9, 11), (2, 7, 8), [1, 1]],
 [(0, 2, 8), (1, 3, 7), (4, 5, 6), (9, 10, 11), [3, 3]],
 [(0, 2, 8), (1, 3, 7), (4, 5, 9), (6, 10, 11), [3, 3]],
 [(0, 2, 8), (1, 3, 7), (5, 6, 10), (4, 9, 11), [3, 3]],
 [(0, 2, 8), (4, 5, 9), (1, 3, 7), (6, 10, 11), [1, 1]],
 [(1, 6, 11), (2, 4, 7), (3, 5, 10), (0, 8, 9), [3, 3]],
 [(1, 6, 11), (2, 4, 7), (8, 9, 10), (0, 3, 5), [3, 3]],
 [(1, 6, 11), (3, 5, 10), (2, 4, 7), (0, 8, 9), [1, 1]],
 [(3, 5, 10), (0, 8, 9), (1, 7, 11), (2, 4, 6), [3, 3]],
 [(3, 8, 10), (0, 5, 9), (1, 6, 11), (2, 4, 7), [3, 3]],
 [(3, 8, 10), (0, 5, 9), (1, 7, 11), (2, 4, 6), [3, 3]],
 [(3, 8, 10), (0, 5, 9), (4, 7, 11), (1, 2, 6), [3, 3]],
 [(3, 8, 10), (1, 7, 11), (0, 5, 9), (2, 4, 6), [1, 1]],
 [(4, 5, 6), (0, 1, 2), (3, 7, 8), (9, 10, 11), [1, 1]],
 [(4, 5, 6), (9, 10, 11), (0, 1, 2), (3, 7, 8), [3, 3]],
 [(4, 5, 9), (6, 10, 11), (0, 1, 2), (3, 7, 8), [3, 3]],
 [(4, 7, 11), (1, 2, 6), (3, 5, 10), (0, 8, 9), [3, 3]]]
#+end_example

The result is divided in four trichords, all in the same class, and
the number of symmetries of the corresponding class.

For instance, let's choose the thirteenth row:

#+begin_src sage
  first_webern_rows[12]
#+end_src

#+RESULTS:
: [(3, 8, 10), (0, 5, 9), (1, 6, 11), (2, 4, 7), [3, 3]]

We can see that the trichords are indeed related by symmetry, by asking what are the symmetries that map one to another.  For instance:

#+begin_src sage
  wrow = first_webern_rows[12]
  t1, t2, t3, t4, _ = wrow
  MS2.symmetry_maps(t1, t2), MS2.symmetry_maps(t2, t4)
#+end_src

#+RESULTS:
: ([(1, 1)], [(2, 0)])

This means that ~rho_2 * phi2~ maps ~[3, 8, 10]~ to ~[0, 5, 9]~ and ~rho2^2~ maps ~[0, 5, 9]~ to ~[2, 4, 7]~.

We can see if this first row has hexachords that are also related by symmetries:

#+begin_src sage
MS2.symmetry_maps(t1 + t2, t3 + t4)
#+end_src

#+RESULTS:
: [(11, 1), (7, 1), (3, 1), (2, 0), (10, 0), (6, 0)]

Indeed, the hexachords are related by three rotations (transpositions) and three reflection (inversions)!

So, now we can use this first row to create a Webern matrix in this system.  We can scramble the order of the trichors, and the other of the pitch classes inside each trichord.  Here we create the matrix using the system itself:

#+begin_src sage
    first_row = [0, 9, 5, 7, 4, 2, 1, 6, 11, 10, 3, 8]
    wm2 = MS2.webern_matrix(first_row)
    print(wm2)
#+end_src

#+RESULTS:
#+begin_example
    |   0   9   5  11   2   7   3  10   6   1   8   4  |
----|--------------------------------------------------|----
 0  |   0   9   5   7   4   2   1   6  11  10   3   8  |   4
 3  |   1   0   3   4   5   6  11  10   9   8   7   2  |   7
 7  |   2   8   0  11   9   4   6   5  10   3   1   7  |  11
 1  |  10   6  11   0   1   3   8   7   2   4   9   5  |   5
10  |   6   2   1   9   0   5  10   3   8   7  11   4  |   2
 5  |   5   4   6   8   2   0   3   1   7  11  10   9  |   9
 9  |   9  11   4   3   7   8   0   2   1   6   5  10  |   1
 2  |   4   7   2  10   8   9   5   0   3   1   6  11  |   6
 6  |  11   1   7   5   3  10   9   8   0   2   4   6  |  10
11  |   7   3   8   6  10  11   4   9   5   0   2   1  |   3
 4  |   8  10   9   1  11   7   2   4   6   5   0   3  |   8
 8  |   3   5  10   2   6   1   7  11   4   9   8   0  |   0
----|--------------------------------------------------|----
    |   8   5   1   7  10   3  11   6   2   9   4   0  |
#+end_example

(We could also have used ~wm2 = WebernMatrix(first_row, MS=MS2)~ for the same result.)

To print in LaTeX, we can also give the names to the maps.  In this case, we can use ~rho2~ and ~phi2~:

#+begin_src sage
  print(wm2.latex('\\rho_2', '\\phi_2'))
#+end_src

#+RESULTS:
#+begin_example
\begin{tabular}{c|cccccccccccc|c}
     &  $\phi_2$ &  $\rho_2^{9} \phi_2$ &  $\rho_2^{5} \phi_2$ &  $\rho_2^{11} \phi_2$ &  $\rho_2^{2} \phi_2$ &  $\rho_2^{7} \phi_2$ &  $\rho_2^{3} \phi_2$ &  $\rho_2^{10} \phi_2$ &  $\rho_2^{6} \phi_2$ &  $\rho_2 \phi_2$ &  $\rho_2^{8} \phi_2$ &  $\rho_2^{4} \phi_2$ &    \\
  \hline
  $1$ & $0$ & $9$ & $5$ & $7$ & $4$ & $2$ & $1$ & $6$ & $11$ & $10$ & $3$ & $8$ & $\rho_2^{4}$ \\
  $\rho_2^{3}$ & $1$ & $0$ & $3$ & $4$ & $5$ & $6$ & $11$ & $10$ & $9$ & $8$ & $7$ & $2$ & $\rho_2^{7}$ \\
  $\rho_2^{7}$ & $2$ & $8$ & $0$ & $11$ & $9$ & $4$ & $6$ & $5$ & $10$ & $3$ & $1$ & $7$ & $\rho_2^{11}$ \\
  $\rho_2$ & $10$ & $6$ & $11$ & $0$ & $1$ & $3$ & $8$ & $7$ & $2$ & $4$ & $9$ & $5$ & $\rho_2^{5}$ \\
  $\rho_2^{10}$ & $6$ & $2$ & $1$ & $9$ & $0$ & $5$ & $10$ & $3$ & $8$ & $7$ & $11$ & $4$ & $\rho_2^{2}$ \\
  $\rho_2^{5}$ & $5$ & $4$ & $6$ & $8$ & $2$ & $0$ & $3$ & $1$ & $7$ & $11$ & $10$ & $9$ & $\rho_2^{9}$ \\
  $\rho_2^{9}$ & $9$ & $11$ & $4$ & $3$ & $7$ & $8$ & $0$ & $2$ & $1$ & $6$ & $5$ & $10$ & $\rho_2$ \\
  $\rho_2^{2}$ & $4$ & $7$ & $2$ & $10$ & $8$ & $9$ & $5$ & $0$ & $3$ & $1$ & $6$ & $11$ & $\rho_2^{6}$ \\
  $\rho_2^{6}$ & $11$ & $1$ & $7$ & $5$ & $3$ & $10$ & $9$ & $8$ & $0$ & $2$ & $4$ & $6$ & $\rho_2^{10}$ \\
  $\rho_2^{11}$ & $7$ & $3$ & $8$ & $6$ & $10$ & $11$ & $4$ & $9$ & $5$ & $0$ & $2$ & $1$ & $\rho_2^{3}$ \\
  $\rho_2^{4}$ & $8$ & $10$ & $9$ & $1$ & $11$ & $7$ & $2$ & $4$ & $6$ & $5$ & $0$ & $3$ & $\rho_2^{8}$ \\
  $\rho_2^{8}$ & $3$ & $5$ & $10$ & $2$ & $6$ & $1$ & $7$ & $11$ & $4$ & $9$ & $8$ & $0$ & $1$ \\
  \hline
     &  $\rho_2^{8} \phi_2$ &  $\rho_2^{5} \phi_2$ &  $\rho_2 \phi_2$ &  $\rho_2^{7} \phi_2$ &  $\rho_2^{10} \phi_2$ &  $\rho_2^{3} \phi_2$ &  $\rho_2^{11} \phi_2$ &  $\rho_2^{6} \phi_2$ &  $\rho_2^{2} \phi_2$ &  $\rho_2^{9} \phi_2$ &  $\rho_2^{4} \phi_2$ &  $\phi_2$ &
\end{tabular}
#+end_example

Note that we need the double ~\~ for the LaTeX names, as in ~'\\rho_2~.
